In [1]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                  'key2':['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2':np.random.randn(5)})

df

  key1 key2     data1     data2
0    a  one -0.284390  0.449719
1    a  two  1.769121 -0.127651
2    b  one -0.685188 -1.033701
3    b  two  1.298488 -0.867566
4    a  one  0.032961 -0.483499

In [2]:
gb = df.groupby(by='key1')
gb.sum()

           key2     data1     data2
key1
a     onetwoone  1.517691 -0.161430
b        onetwo  0.613300 -1.901266

In [3]:
gb1 = df.groupby(by='key1')[['data1','data2']]
gb1.sum()

         data1     data2
key1
a     1.517691 -0.161430
b     0.613300 -1.901266